/****************************************Copyright (c)****************************************************
**                         			BEIJING	WANJI(WJ)                               
**                                     
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			Timer0.c
** Last modified Date:  2011-04-12
** Last Version:		1.0
** Descriptions:		计时器0相关函数
**
**--------------------------------------------------------------------------------------------------------
** Created by:			ZHANG Ye
** Created date:		2011-04-12
** Version:				1.0
** Descriptions:		Timer0
**
**--------------------------------------------------------------------------------------------------------
** Modified by:			
** Modified date:		
** Version:
** Descriptions:
**
*********************************************************************************************************/
#define	__TIMER0_C
#include "Timer0.h"
#include "WT_Task.h"
#include "common.h"
#include "UART5.h"
#include "socket.h"
#include "Task_Checknet.h"
#include "Avi_AxleCheck.h"

/*********************************************************************************************************
** 函数名称:  IRQ_Timer0
** 函数功能:  定时器0中断服务程序。
** 入口参数:  无
** 出口参数:  无
** 函数说明:
*********************************************************************************************************/
void IRQ_Timer0(void)
{
    T0IR			= 0x01;					                /* 清除中断标志	                */
	
	if(g_WeigthAt.u8wAckEnable)
	{
		g_WeigthAt.u16wAckTmCnt++;
		if(g_WeigthAt.u16wAckTmCnt>500)
		{
			g_WeigthAt.u16wAckTmCnt=0;
			g_WeigthAt.u8wAckSendFlag=1;
		}
	}
    OSTimeTick(); 						   						//2ms  UCOS时钟节拍	
}

/***************************************************************************************
**
**   Time0初始化函数
**
****************************************************************************************/
void Time0Init(void)
{
    MIC_ER			|= (1<<16);									//使能Timer0中断
    TIMCLK_CTRL1	= 0x04;                             		/* 使能定时器0的时钟            */
    T0TCR			= 0x02;                           			/* 复位并禁能定时器0            */
    T0IR			= 0xFF;                           			/* 清除所有中断                 */
    T0TC			= 0x00000000;								/* 定时器设置为0                */
    T0PR			= 0x0000000F;						 		/* 时钟16分频                   */
    T0PC			= 0x00000000;
    T0MCR			= 0x0003;						       		/* 设置T0MR0匹配后复位T0TC，    */
//	T0MCR			= 0x0001;//  更改 	                                                    		/* 并产生中断标志               */
    T0CTCR			= 0x00;
    T0MR0			= Fpclk / (16*OS_TICKS_PER_SEC);			/* 2ms定时                    */
    //10ms
    T0TCR			= 0x01;						   				/* 启动定时器0                  */
    micIrqFuncSet(16, 0, (unsigned int)IRQ_Timer0);				/* 加入中断向量表				*/
}
