/****************************************Copyright (c)****************************************************
**                         			BEIJING	WANJI(WJ)
**
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			Timer1h.c
** Last modified Date:  2012-5-9
** Last Version:		1.0
** Descriptions:		计时器1相关函数
**
**--------------------------------------------------------------------------------------------------------
** Created by:			Hongxy
** Created date:		2
** Version:
** Descriptions:		Timer1
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#define	__TIMER1_C
#include "Timer1.h"
#include "Common.h"
#include "UART5.h"
#include "socket.h"
#include "Task_Checknet.h"

static	void IRQ_Timer1(void);		//中断处理
__align(2)   uint8 RdToLMSSendData[24] = {0x02,0x02,0x02,0x02,0x00,0x00,0x00,0x0F,0x73,0x52,0x4E,0x20,0x4C,0x4D,0x44,0x73,0x63,0x61,0x6E,0x64,0x61,0x74,0x61,0x05};
__align(2)  uint8 LianxuLMSSendData[26]= {0x02,0x02,0x02,0x02,0x00,0x00,0x00,0x11,0x73,0x45,0x4E,0x20,0x4C,0x4D,0x44,0x73,0x63,0x61,0x6E,0x64,0x61,0x74,0x61,0x20,0x01,0x33};

/****************HH*****************************************************************************************
** 函数名称:  IRQ_Timer1
** 函数功能:  定时器1中断服务程序。
** 入口参数:  无
** 出口参数:  无
** 函数说明:  20ms进行一次中断
*********************************************************************************************************/
void IRQ_Timer1(void)
{

	T1IR			= 0x01;					                /* 清除中断标志	                */

	if(Flag_NetConnect==1)
	{

		//发送激光0数据请求
		S_tx_process(0,RdToLMSSendData, 24);  
		
	}


}

/***************************************************************************************
**
**   Time1初始化函数
**
****************************************************************************************/
void Time1Init(void)
{
	MIC_ER			|= (1<<17);									//使能Timer0中断
	//中断控制寄存器；Book：P.142；
	//
	TIMCLK_CTRL1	= TIMCLK_CTRL1|0x08;     //P.131            /* 使能定时器1的时钟            */
	T1TCR			= 0x02;                           			/* 复位并禁能定时器1            */
	T1IR			= 0xFF;                           			/* 清除所有中断                 */
	T1TC			= 0x00000000;//定时器计数器					/* 定时器设置为0                */
	T1PR			= 0x0000000F;						 		/* 时钟16分频                   */
	T1PC			= 0x00000000;
	T1MCR			= 0x00000003;						       		/* 设置T1MR0匹配后复位T1TC，    */
	/* 并产生中断标志               */
	//T1TC定时器计数器；通过读它的值，可以计算精确的时间；
	//系统13MHz,每1秒运行13M步，
	//16分频，每16步，计数器加1；
	//所以一秒内，计数器加至（13M/16），即13M/16个计数周期
	T1CTCR			= 0x00;
	T1MR0			= Fpclk / (16*50);			/* 20ms定时    10ms定时为(16*100)                */
	//			(13M/16)/OS_TICKS_PER_SEC 计数器一秒内的计数周期除以OS_TICKS_PER_SEC；

	T1TCR			= 0x01;						   				/* 启动定时器1                  */

	micIrqFuncSet(17, 0, (unsigned int)IRQ_Timer1);				/* 加入中断向量表				*/
	//17定时器1中断；16定时器0中断；
}

